app/views/students/index.html.erb

        <div class="col-lg-4 form-group float-left">
          <%= f.select :name_cont, options_from_collection_for_select(@students_list_by_name, "name", ->(st){"#{st.name} \u{27F6} #{st.class_section.level.name} , #{st.class_section.section.name}"}),{:include_blank => "Select Name"},:class=>"form-control select_chosen" %>
---
SELECT  `levels`.* FROM `levels` WHERE `levels`.`id` = 2 LIMIT 1
SELECT  `sections`.* FROM `sections` WHERE `sections`.`id` = 1 LIMIT 1