app/views/unpaid_students/_print_student.pdf.erb

SELECT `students`.* FROM `students`
---
  <div class='row'>
    <% ['Student Copy', 'School Copy', 'Accountant Copy'].each do |slip_copy| %>