app/views/unpaid_students/_print_student.pdf.erb

  <br>
  We are Thankful For your Trust in Educational School System.
  <span><%= student.name.capitalize %></span> Father name is <span><%= student.father_name.capitalize %></span>, Student of <span><%= student.class_section.level.name+" " %><%= student.class_section.section.name%></span> is very good in Studies and teachers always praised your child.
  The management of school want your attention toward the school fee.We request you to please <span>deposit the school fee</span> as soon as possible to avoid any inconvenience.
  <% if student.balance.present? and student.balance < 0 %>
---
SELECT  `levels`.* FROM `levels` WHERE `levels`.`id` = 2 LIMIT 1
SELECT  `sections`.* FROM `sections` WHERE `sections`.`id` = 1 LIMIT 1