app/views/unpaid_students/index.html.erb

SELECT `levels`.* FROM `levels`
---
        <div class="col-lg-4 form-group float-left">
          <%= f.select :class_section_level_id_eq, options_from_collection_for_select(Level.all, "id", "name", @level_id),{:include_blank => "Select Class"},:class=>"form-control " %>

SELECT `sections`.* FROM `sections`
---
        <div class="col-lg-4 form-group float-left">
          <%= f.select :class_section_section_id_eq, options_from_collection_for_select(Section.all, "id", "name", @section_id),{:include_blank => "Select Section"},:class=>"form-control " %>