app/controllers/school_branches_controller.rb

SELECT `school_branches`.* FROM `school_branches` WHERE `school_branches`.`school_id` = 1
---
    def set_school_branch
      @schoolBranch = SchoolBranch.find(params[:id])