app/controllers/students_controller.rb

SELECT DISTINCT COUNT(DISTINCT `students`.`id`) FROM `students` WHERE `students`.`deleted` = 0
---
  def index
    # if session[:school_branch_id].present? or session[:section_id] or session[:level_id].present?
      # params = ActionController::Parameters.new(q: { class_section_section_id_eq: session[:section_id], class_section_level_id_eq: session[:level_id],school_branch_id_eq: session[:school_branch_id]})
      # params.permitted?
    # else
      # params = ActionController::Parameters.new()
    # end
    response = HTTParty.get('http://sms4connect.com/api/sendsms.php/balance/status?id=essystem&pass=system65')
    puts response.body, response.code, response.message, response.headers.inspect
    hash = Hash.from_xml(response)
    # @api_balance = hash.first.last.first.last.pluck("response").map(&:to_i).sum
    @students_list_by_name=Student.where(deleted: false).distinct(:name)

SELECT `student_fees`.* FROM `student_fees` WHERE (extract(month from student_fees.paid_date) = 1 AND extract(year from student_fees.paid_date) = 2022 AND student_fees.fee_type = 'Fee' AND student_id IN (1))
SELECT COUNT(*) FROM `student_fees` WHERE (extract(month from student_fees.paid_date) = 9 AND extract(year from student_fees.paid_date) = 2021 AND student_fees.fee_type = 'Fee' AND student_id IN (NULL))
---
    #student fees
    st_ids = []
    @students_sms.each{|st| st_ids << st.id}
    @students_fees = StudentFee.where("extract(month from student_fees.paid_date) = ? AND extract(year from student_fees.paid_date) = ? AND student_fees.fee_type = ? AND student_id IN (?)", Date.today.month, Date.today.year, "Fee", st_ids)
    @total_paid=@students_fees.count()