app/controllers/unpaid_students_controller.rb

  def index
    response = HTTParty.get('http://sms4connect.com/api/sendsms.php/balance/status?id=essystem&pass=system65')
    puts response.body, response.code, response.message, response.headers.inspect
    hash = Hash.from_xml(response)
    @api_balance = hash.first.last.first.last.pluck("response").map(&:to_i).sum
    if params[:unpaid_student].present?
      @paid_to_month = params[:unpaid_student][:month]
      @paid_to_year = params[:unpaid_student][:year]
    else
      @paid_to_month = Date.today.month
      @paid_to_year = Date.today.year
    end
    paid_students = StudentFee.where("extract(month from student_fees.paid_date) = ? AND extract(year from student_fees.paid_date) = ? AND student_fees.fee_type = ?", @paid_to_month, @paid_to_year, "Fee")
    @q = Student.where.not(id: paid_students.pluck(:student_id)).where("deleted=false AND student_type = ?", 0).ransack(params[:q])

    @aps_count=Student.where("deleted=false AND admission_balance < 0 OR security_balance < 0 OR paper_fund_balance < 0").count()
    if @q.result.count > 0
      @q.sorts = 'id asc' if @q.sorts.empty?
    end
    if params[:q].present?
      @name = params[:q][:name_cont]
      @father = params[:q][:father_name_cont]
      @school_branch_id = params[:q][:school_branch_id_eq]
      @level_id = params[:q][:class_section_level_id_eq]
      @section_id = params[:q][:class_section_section_id_eq]
    end

    @students = @q.result(distinct: true).page(params[:page])
---
SELECT `students`.* FROM `students` WHERE (deleted=false AND student_type = 0 OR admission_balance < 0 OR security_balance < 0 OR paper_fund_balance < 0)
SELECT `student_fees`.`student_id` FROM `student_fees` WHERE (extract(month from student_fees.paid_date) = 9 AND extract(year from student_fees.paid_date) = 2021 AND student_fees.fee_type = 'Fee')
SELECT COUNT(*) FROM `students` WHERE (deleted=false AND admission_balance < 0 OR security_balance < 0 OR paper_fund_balance < 0)
SELECT  DISTINCT `students`.* FROM `students` WHERE (1=1) AND (deleted=false AND student_type = 0) ORDER BY `students`.`id` ASC LIMIT 55 OFFSET 0
SELECT COUNT(DISTINCT count_column) FROM (SELECT  DISTINCT `students`.`id` AS count_column FROM `students` WHERE (1=1) AND (deleted=false AND student_type = 0) LIMIT 55 OFFSET 0) subquery_for_count


    session[:unpaid_students_ids] = @students.pluck(:id)
    session[:unpaid_students_search_date] = "01-#{@paid_to_month}-#{@paid_to_year}"
    @school_branches = SchoolBranch.where(school_id: current_user.school_id)
---
SELECT `school_branches`.* FROM `school_branches` WHERE `school_branches`.`school_id` = 1

  def print_all
    unpaid_students_ids = session[:unpaid_students_ids]
    unpaid_students_search_date = session[:unpaid_students_search_date]
    @students = Student.where(id: unpaid_students_ids)
---
SELECT `students`.* FROM `students` WHERE `students`.`id` = 1

  def print_for_all
    @paid_to_month = Date.today.month
    @paid_to_year = Date.today.year
    unpaid_students_ids = session[:unpaid_students_ids]
    unpaid_students_search_date = "01-#{@paid_to_month}-#{@paid_to_year}"
    @students = Student.where(id: unpaid_students_ids).where(student_type: 0)
---
SELECT `students`.* FROM `students` WHERE `students`.`id` = 1 AND `students`.`student_type` = 0

  def print_all_without_balance
    unpaid_students_ids = session[:unpaid_students_ids]
    unpaid_students_search_date = session[:unpaid_students_search_date]
    @students = Student.where(id: unpaid_students_ids)
---
SELECT `students`.* FROM `students` WHERE `students`.`id` = 1